In [2]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression

In [6]:
df=pd.read_csv(r'C:\Users\Shashree\Desktop\Projects\Salary_pred\hiring.csv')
df.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   experience       6 non-null      object
 1   test_score       7 non-null      float64
 2   interview_score  8 non-null      int64
 3   salary           8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [8]:
df['experience'].unique()

array([nan, 'five', 'two', 'seven', 'three', 'ten', 'eleven'],
      dtype=object)

In [9]:
df['experience'].replace({'nan':0, 'five':5, 'two':2, 'seven':7, 'three':3, 'ten':10, 'eleven':11},inplace=True)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   experience       6 non-null      float64
 1   test_score       7 non-null      float64
 2   interview_score  8 non-null      int64
 3   salary           8 non-null      int64
dtypes: float64(2), int64(2)
memory usage: 384.0 bytes

In [11]:
df.describe()

       experience  test_score  interview_score       salary
count    6.000000    7.000000         8.000000      8.00000
mean     6.333333    7.857143         7.875000  63000.00000
std      3.669696    1.345185         1.642081  11501.55269
min      2.000000    6.000000         6.000000  45000.00000
25%      3.500000    7.000000         6.750000  57500.00000
50%      6.000000    8.000000         7.500000  63500.00000
75%      9.250000    8.500000         9.250000  70500.00000
max     11.000000   10.000000        10.000000  80000.00000

In [13]:
df['experience'].fillna(df['experience'].mean(),inplace=True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   experience       8 non-null      float64
 1   test_score       7 non-null      float64
 2   interview_score  8 non-null      int64
 3   salary           8 non-null      int64
dtypes: float64(2), int64(2)
memory usage: 384.0 bytes

In [15]:
df['test_score'].fillna(df['test_score'].mean(),inplace=True)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   experience       8 non-null      float64
 1   test_score       8 non-null      float64
 2   interview_score  8 non-null      int64
 3   salary           8 non-null      int64
dtypes: float64(2), int64(2)
memory usage: 384.0 bytes

In [22]:
x=df.iloc[:,:3]
y=df['salary']

In [23]:
x

   experience  test_score  interview_score
0    6.333333    8.000000                9
1    6.333333    8.000000                6
2    5.000000    6.000000                7
3    2.000000   10.000000               10
4    7.000000    9.000000                6
5    3.000000    7.000000               10
6   10.000000    7.857143                7
7   11.000000    7.000000                8

In [24]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [25]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=10)

In [26]:
lr_model=LinearRegression()

In [27]:
lr_model.fit(x_train,y_train)

LinearRegression()

In [29]:
y_pred=lr_model.predict(x_test)

In [30]:
y_pred

array([52757.91469303, 51651.02516614])

In [31]:
import pickle
pickle.dump(lr_model,open('model.pkl','wb'))